{
  "timestamp": "2025-08-21T10:29:48.201881",
  "title": "Founder & Strategic Advisor",
  "story": "Most international brands hit a wall trying to scale in Korea, not because their product isn’t good enough, but because the partner strategies, messaging, and trust-building tactics that work in other markets fail here. As Founder of LV Global, I help businesses, especially B2B firms and scale-up founders, accelerate entry, reputation, and trusted partnerships in Korea and across APAC through strategy advisory, C-suite mentoring, and market-entry projects. What I Do: 1. Strategic advisory for B2B market entry, reputation, and business development in Korea and APAC. 2. Build and refine go-to-market playbooks for Western and global brands—so your market entry actually sticks. 3. Created the Expansion Friction Map™: a proprietary framework to spot hidden barriers, reduce costly missteps, and cut “time to traction” for new entrants. 4. Mentor, train, and coach CxOs, founders, and BD teams to navigate high-stakes negotiation, sales, and cross-cultural influence. 5. Partner with SMEs, family businesses, and growth-stage brands to unlock first contracts, brand authority, and sustainable Korean business networks. Results: - Helped 30+ brands and leaders bypass the 3-year learning curve and win sales and trust faster—often in spaces where global brands were previously stalled. - Advised 100+ founders, CEOs, and executive teams via workshops, coaching, and cross-border GTM labs in Korea/Asia. - 3 Recognized as a go-to expert for “rebuild” market entries where previous attempts failed and reputation/partnership trust needed a rapid reset.",
  "bullet_before": [
    "Founded LV Global to provide strategic advisory services for B2B market entry in Korea and APAC, resulting in **30+ brands** bypassing the typical **3-year** learning curve to achieve faster sales and trust.",
    "Developed and refined go-to-market playbooks for Western brands, effectively increasing their market entry success rate by addressing cultural nuances and partnership strategies over a period of **12 months**.",
    "Created the Expansion Friction Map™, a proprietary framework that identified hidden barriers, reducing costly missteps and cutting “time to traction” for new entrants by **25%**.",
    "Mentored and trained over **100** CxOs and founders through workshops and coaching in high-stakes negotiation and sales strategies, enhancing their cross-cultural influence within **6 months**.",
    "Partnered with SMEs and growth-stage brands to establish their first contracts and build sustainable business networks in Korea, achieving brand authority within **3-4 months** of collaboration."
  ],
  "answers": [
    "Around 70% and it takes 6 months",
    "It is a result of 16 years of experiences. I have been using it for the clients all these times.",
    "It is very diverse and most of them consume my content but it impacts them in the decision making regarding their businesses across industry."
  ],
  "bullet_after": [
    "Guided 30+ brands, achieving a 70% faster market entry, cutting the usual 3-year learning curve to just 6 months in Korea and APAC.",
    "Developed the Expansion Friction Map™, reducing operational missteps and enhancing ROI for clients across diverse industries over 16 years.",
    "Mentored over 100 founders and CEOs, significantly improving decision-making and cross-cultural negotiation skills in high-stakes environments."
  ],
  "skills": [
    "Strategic Market Entry",
    "B2B Business Development",
    "Cross-Cultural Communication",
    "Go-To-Market Strategy",
    "Executive Coaching",
    "Market Analysis (optional)",
    "Negotiation Skills (optional)"
  ],
  "suggestions": "- Include specific revenue growth percentages for brands post-engagement.\n- Highlight case studies or examples of successful market entries.\n- Quantify the impact of training sessions, such as improved sales figures or partnership success rates."
}